pvvx/esp8266web/app/web/web_srv.c
// Initial response strings (Corresponding to HTTP_STATUS)
static const HTTP_RESPONSE ICACHE_RODATA_ATTR HTTPResponse[] ICACHE_RODATA_ATTR = {
        { 200, HTTP_RESP_FLG_NONE,
        		HTTPresponse_200_head,
                NULL },
         // успешный запрос. Если клиентом были запрошены какие-либо данные, то они находятся в заголовке и/или теле сообщения.
        { 302, HTTP_RESP_FLG_NONE | HTTP_RESP_FLG_REDIRECT,
        		HTTPresponse_302_head,
                NULL },
// "HTTP/1.1 302 Found\r\nConnection: close\r\nLocation: ",
         // 302 Found, 302 Moved Temporarily - запрошенный документ временно
         // доступен по другому URI, указанному в заголовке в поле Location.
         // Этот код может быть использован, например, при управляемом сервером
         // согласовании содержимого. Некоторые клиенты некорректно ведут себя
         // при обработке данного кода.
        { 304, HTTP_RESP_FLG_NONE,
        		HTTPresponse_304_head,
                NULL },
///"304 Redirect: ",   // If-Modified-Since If-None-Match
         // сервер возвращает такой код, если клиент запросил документ методом GET,
         // использовал заголовок If-Modified-Since или If-None-Match и документ
         // не изменился с указанного момента. При этом сообщение сервера не должно содержать тела.
        { 400, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_400_head,
                NULL} ,
         // сервер обнаружил в запросе клиента синтаксическую ошибку.
        { 401, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_401_head,
				HTTPresponse_401_content },
         // для доступа к запрашиваемому ресурсу требуется аутентификация.
         // В заголовке ответ должен содержать поле WWW-Authenticate с перечнем
         // условий аутентификации. Клиент может повторить запрос,
         // включив в заголовок сообщения поле Authorization с требуемыми для аутентификации данными.
//"HTTP/1.1 403 Forbidden\r\nConnection: close\r\n\r\n403 Forbidden: SSL Required - use HTTPS\r\n"
        { 404, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_404_head,
				HTTPresponse_404_content },
         // Сервер понял запрос, но не нашёл соответствующего ресурса по указанному URI.
        { 411, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_411_head,
				HTTPresponse_411_content },
         // для указанного ресурса клиент должен указать Content-Length в заголовке запроса.
         // Без указания этого поля не стоит делать повторную попытку запроса к серверу по данному URI.
         // Такой ответ естественен для запросов типа POST и PUT.
         // Например, если по указанному URI производится загрузка файлов, а на сервере стоит
         // ограничение на их объём. Тогда разумней будет проверить в самом начале заголовок
         // Content-Length и сразу отказать в загрузке, чем провоцировать бессмысленную нагрузку,
         // разрывая соединение, когда клиент действительно пришлёт слишком объёмное сообщение.
        { 413, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_413_head,
				HTTPresponse_413_content },
         // возвращается в случае, если сервер отказывается обработать запрос
         // по причине слишком большого размера тела запроса. Сервер может закрыть соединение,
         // чтобы прекратить дальнейшую передачу запроса.
        { 414, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_414_head,
				HTTPresponse_414_content },
         // сервер не может обработать запрос из-за слишком длинного указанного URL.
         // Такую ошибку можно спровоцировать, например, когда клиент пытается передать длинные
         // параметры через метод GET, а не POST.
        { 429, HTTP_RESP_FLG_NONE,
        		HTTPresponse_429_head,
                NULL },
         // клиент попытался отправить слишком много запросов за короткое время, что может указывать,
         // например, на попытку DoS-атаки. Может сопровождаться заголовком Retry-After, указывающим,
         // через какое время можно повторить запрос.
        { 501, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_501_head,
				HTTPresponse_501_content },
         // сервер не поддерживает возможностей, необходимых для обработки запроса.
         // Типичный ответ для случаев, когда сервер не понимает указанный в запросе метод. + см 405
        { 418, HTTP_RESP_FLG_FINDFILE,
        		HTTPresponse_418_head,
				HTTPresponse_418_content },
         // http://en.wikipedia.org/wiki/Hyper_Text_Coffee_Pot_Control_Protocol
		{ 500, HTTP_RESP_FLG_END,
				HTTPresponse_500_head,
				HTTPresponse_500_content }
		// любая внутренняя ошибка сервера, которая не входит в рамки остальных ошибок класса.
};
/*
#ifdef WEBSOCKET_ENA
		"HTTP/1.1 101 Switching Protocols\r\n
        Upgrade: websocket\r\n
        Connection: Upgrade\r\n
        Sec-WebSocket-Accept: s3pPLMBiTxaQ9kYGzzhZRbK+xOo=\r\n\r\n"
#endif
*/

const char HTTPfsupload[] ICACHE_RODATA_ATTR = "<html><body style='margin:100px'><form method='post' action='/fsupload' enctype='multipart/form-data'><b>File Upload</b><p><input type='file' name='file' size=40> <input type='submit' value='Upload'></form></body></html>";
const char HTTPdefault[] ICACHE_RODATA_ATTR = "<html><h3>ESP8266 Built-in Web server <sup><i>&copy</i></sup></h3></html>";

#define sizeHTTPfsupload 220
#define sizeHTTPdefault 73

//        const uint8 *HTTPCacheControl = "Cache-Control:";
const char *HTTPContentLength = "Content-Length:";
#define sizeHTTPContentLength 15
//        const uint8 *HTTPConnection = "Connection: ";
//        #define sizeHTTPConnection 12
//        const uint8 *HTTPkeepalive = "keep-alive";
//        #define sizeHTTPkeepalive 10
//        const uint8 *HTTPIfNoneMatch = "If-None-Match:"
//        #define sizeHTTPIfNoneMatch 14
const char *HTTPContentType = "Content-Type:";
#define sizeHTTPContentType 13
const char *HTTPmultipartformdata = "multipart/form-data";
#define sizeHTTPmultipartformdata 19
const char *HTTPboundary = "boundary=";
#define sizeHTTPboundary 9
const char *HTTPAuthorization = "Authorization:";
#define sizeHTTPAuthorization 14
const char *HTTPCookie = "Cookie:";
#define sizeHTTPCookie 7

