pvvx/esp8266web/app/web/web_srv.c
#ifdef WEBSOCKET_ENA
const uint8 *HTTPUpgrade = "Upgrade:";
#define sizeHTTPUpgrade 8
const uint8 *HTTPwebsocket = "websocket";
#define sizeHTTPwebsocket 9
const uint8 *HTTPSecWebSocketKey = "Sec-WebSocket-Key:";
#define sizeHTTPSecWebSocketKey 18
//		const uint8 *HTTPSecWebSocketProtocol = "Sec-WebSocket-Protocol:";
//		#define sizeHTTPSecWebSocketProtocol 23
#endif
/******************************************************************************
 * FunctionName : Close_web_conn
 * Description  : Free  ts_conn
 * Parameters   : struct TCP_SERV_CONN
 * Returns      : none
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR Close_web_conn(TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	int i = 0;
     do {
       if(web_conn->bffiles[i] != WEBFS_INVALID_HANDLE) {
#if DEBUGSOO > 1
	os_printf("cf%d ", web_conn->bffiles[i]);
#endif
         if(web_conn->bffiles[i] <= WEBFS_MAX_HANDLE) WEBFSClose(web_conn->bffiles[i]);
         web_conn->bffiles[i] = WEBFS_INVALID_HANDLE;
       };
       i++;
     }while(i < 4);
     ClrSCB(SCB_FOPEN | SCB_FGZIP | SCB_FCALBACK);
}
/******************************************************************************
 * FunctionName : ReNew_web_conn
 * Description  :
 * Parameters   : struct TCP_SERV_CONN
 * Returns      : none
*******************************************************************************/
LOCAL WEB_SRV_CONN * ICACHE_FLASH_ATTR ReNew_web_conn(TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	if(web_conn == NULL) {
		web_conn = (WEB_SRV_CONN *)os_zalloc(sizeof(WEB_SRV_CONN));
		if(web_conn != NULL) {
			web_conn->bffiles[0] = 0xff;
			web_conn->bffiles[1] = 0xff;
			web_conn->bffiles[2] = 0xff;
			web_conn->bffiles[3] = 0xff;
		//  web_conn->webflag = 0; //zalloc
		//  web_conn->func_web_cb = NULL; //zalloc
			OpenSCB(); // сбросить флаги
			ts_conn->linkd = (void *)web_conn;
		};
	}
    return web_conn;
}
//=============================================================================
// Authorization: Basic QWxhZGRpbjpvcGVuIHNlc2FtZQ==\n"
// The resulting string is then encoded using the RFC2045-MIME variant of Base64,
// except not limited to 76 uint8/line
// /ssl/crypto/ssl_crypto_misc.c:
// EXP_FUNC int STDCALL base64_decode(const uint8 *in,  int len, uint8_t *out, int *outlen);
// Username and password are combined into a string "username:password"
LOCAL bool ICACHE_FLASH_ATTR CheckAuthorization(uint8* base64str)
{
	uint8 *pcmp = base64str;
	int len = 0;
	while(*pcmp++ >= '+') len++;
//	struct softap_config apcfg;
	uint8 pbuf[77];
	int declen = 76;
	if((len >= 4)&&(len <= 128)
	&&(base64decode(base64str, len, pbuf, &declen))
/*
		&&(wifi_softap_get_config(&apcfg))
		&&(apcfg.ssid_len <= 31))
*/	) {
		pbuf[declen]='\0';
		uint8 ppsw[32+64+1];
		cmpcpystr(ppsw, wificonfig.ap.config.ssid, '\0','\0', 32);
		len = ets_strlen((char*)ppsw);
		ppsw[len++] = ':';
		cmpcpystr(&ppsw[len], wificonfig.ap.config.password, '\0','\0', 64);
#if DEBUGSOO > 1
		os_printf("'%s' ", pbuf);
#endif
#if DEBUGSOO > 2
		os_printf("<%s>[%u] ", ppsw, declen);
#endif
		if(os_strncmp(pbuf, (char *)ppsw , declen) == 0) return true;
	};
	return false;
}
//=============================================================================
#ifdef WEBSOCKET_ENA
// 1) взять строковое значение из заголовка Sec-WebSocket-Key и объединить со
//	строкой 258EAFA5-E914-47DA-95CA-C5AB0DC85B11
// 2) вычислить бинарный хеш SHA-1 (бинарная строка из 20 символов) от полученной
//	в первом пункте строки
// 3) закодировать хеш в Base64
//=============================================================================
const uint8 WebSocketAddKey[] ICACHE_RODATA_ATTR = "258EAFA5-E914-47DA-95CA-C5AB0DC85B11";
#define sizeWebSocketAddKey 36
#define sizeWebSocketKey 24
#define sizeWebSocketAcKey 28
bool ICACHE_FLASH_ATTR WebSocketAcceptKey(uint8* dkey, uint8* skey)
{
	uint8 keybuf[sizeWebSocketAddKey];
	SHA1_CTX cha;
	int len = 0;
	{
		uint8 *pcmp = skey;
		while(*pcmp >= '+' && len < sizeWebSocketKey) {
			pcmp++;
			len++;
		};
		if(len != sizeWebSocketKey) return false;
		ets_memcpy(keybuf, WebSocketAddKey, sizeWebSocketAddKey);
	};
	SHA1Init(&cha);
	SHA1Update(&cha, skey, len);
	SHA1Update(&cha, keybuf, sizeWebSocketAddKey);
	SHA1Final(keybuf, &cha);
	len = base64encode(dkey, 31, keybuf, SHA1_HASH_LEN);
#if DEBUGSOO > 2
	os_printf("\ncha:'");
	print_hex_dump(keybuf, SHA1_HASH_LEN, '\0');
	os_printf("'\n");
	os_printf("key[%u]:'%s'\n", len, dkey);
#endif
   	return true;
}
//=============================================================================
#endif
//=============================================================================
LOCAL void ICACHE_FLASH_ATTR
web_parse_cookie(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	if((CurHTTP->pcookie == NULL)||(CurHTTP->cookie_len == 0)) return;
	uint8 pcmd[CmdNameSize];
	uint8 pvar[VarNameSize*3];
	uint8 *pcmp = CurHTTP->pcookie - 1;
	do {
		pcmp = cmpcpystr(pvar, ++pcmp, '\0', '=', sizeof(pvar)-1);
		if(pcmp == NULL) return;
		urldecode(pcmd, pvar, CmdNameSize - 1, sizeof(pvar));
		pcmp = cmpcpystr(pvar, pcmp, '=', ';', sizeof(pvar)-1);
		if(pcmd[0]!='\0') {
			urldecode(pvar, pvar, VarNameSize - 1, sizeof(pvar));
			web_int_vars(ts_conn, pcmd, pvar);
	    }
	} while(pcmp != NULL);
}
//=============================================================================
LOCAL void ICACHE_FLASH_ATTR
web_parse_uri_vars(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	if((CurHTTP->puri == NULL)||(CurHTTP->uri_len == 0)) return;
	uint8 pcmd[CmdNameSize];
	uint8 pvar[VarNameSize*3];
	uint8 *pcmp = CurHTTP->puri;
	uint8 c = '?';
	pcmp = cmpcpystr(NULL, pcmp, '\0', c, CurHTTP->uri_len);
	while(pcmp != NULL) {
		pcmp = cmpcpystr(pvar, pcmp, c, '=', sizeof(pvar)-1);
		if(pcmp == NULL) return;
		urldecode(pcmd, pvar, CmdNameSize - 1, sizeof(pvar));
		c = '&';
		pcmp = cmpcpystr(pvar, pcmp, '=', c, sizeof(pvar)-1);
		if(pcmd[0]!='\0') {
			urldecode(pvar, pvar, VarNameSize - 1, sizeof(pvar));
			web_int_vars(ts_conn, pcmd, pvar);
	    }
	};
}
//=============================================================================
LOCAL void ICACHE_FLASH_ATTR
web_parse_content(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	if((CurHTTP->pcontent == NULL)||(CurHTTP->content_len == 0)) return;
	uint8 pcmd[CmdNameSize];
	uint8 pvar[VarNameSize*3];
	uint8 *pcmp = CurHTTP->pcontent;
	uint8 c = '\0';
	do {
		pcmp = cmpcpystr(pvar, pcmp, c, '=', sizeof(pvar)-1);
		if(pcmp == NULL) return;
		urldecode(pcmd, pvar, CmdNameSize - 1, sizeof(pvar));
		c = '&';
		pcmp = cmpcpystr(pvar, pcmp, '=', c, sizeof(pvar)-1);
		if(pcmd[0]!='\0') {
			urldecode(pvar, pvar, VarNameSize - 1, sizeof(pvar));
			web_int_vars(ts_conn, pcmd, pvar);
	    }
	} while(pcmp != NULL);
}
//=============================================================================
// Разбор имени файла и перевод в вид относительного URI.
// (выкидывание HTTP://Host)
// Проверка на обращение в папку или имя файла требующее пароль
//=============================================================================
LOCAL void ICACHE_FLASH_ATTR
web_parse_fname(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
    if(CurHTTP->puri == NULL) return;
    if(CurHTTP->uri_len < 2) { // = "/"?
    	CurHTTP->pFilename[0] = CurHTTP->puri[0];
    	return;
    }
    {
        uint8 cbuf[FileNameSize+16];
        uint8 *pcbuf = cbuf;
        urldecode(pcbuf, CurHTTP->puri, sizeof(cbuf) - 1, CurHTTP->uri_len);
    	if((os_strncmp((char *)pcbuf, "HTTP://", 7) == 0)||(os_strncmp((char *)pcbuf, "http://", 7) == 0)) {
    		pcbuf += 7;
    		uint8 *pcmp = os_strchr((char *)pcbuf, '/');
    		if(pcmp != NULL) pcbuf = pcmp;
    	};
        cmpcpystr(CurHTTP->pFilename, pcbuf, '\0', '?', FileNameSize);
    };
    { // Проверка на обращение в папку или имя файла требующее пароль
    	uint8 *pcmp = web_strnstr(CurHTTP->pFilename, ProtectedFilesName, os_strlen(CurHTTP->pFilename));
        if(pcmp != NULL) {
        	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
        	SetSCB(SCB_AUTH);
        }
    };
}
//=============================================================================
//=============================================================================
uint8 * ICACHE_FLASH_ATTR head_find_ctr(HTTP_CONN *CurHTTP, const uint8 * c, int clen, int dlen)
{
	if(CurHTTP->head_len < clen + dlen + 2) return NULL; // + "\r\n"
	uint8 * pstr = web_strnstr((char *)CurHTTP->phead, c, CurHTTP->head_len);
	if(pstr != NULL) {
		pstr += clen;
		uint8 *pend = web_strnstr(pstr, CRLF, CurHTTP->phead + CurHTTP->head_len - pstr);
		if(pend == NULL) {
			CurHTTP->httpStatus = 400; // 400 Bad Request
			return NULL;
		}
		while(*pstr == ' ' && pstr < pend) pstr++;
		if(pend - pstr < dlen) {
			CurHTTP->httpStatus = 400; // 400 Bad Request
			return NULL;
		}
    }
	return pstr;
}
//=============================================================================
// Func: parse_header
// Разбирает докачан или нет заголовок HTTP, что там принято, GET или POST,
// открывает файл и проверяет content, если это POST и не прием файла.
//=============================================================================
LOCAL bool ICACHE_FLASH_ATTR
parse_header(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	CurHTTP->httpStatus = 501; // 501 Not Implemented (not a GET or POST command)

