pvvx/esp8266web/app/web/web_srv.c
    uint8 *pstr = ts_conn->pbufi;
    uint8 *pend = &ts_conn->pbufi[ts_conn->sizei];
    CurHTTP->pcontent = pend;

    if(pstr == NULL) {
      CurHTTP->httpStatus =  500; // 500 Internal Server Error
      return false;
    };
    if(ts_conn->sizei < MIN_REQ_LEN) return false; // 501 Not Implemented (not a GET or POST command)
    uint8 *pnext = web_strnstr(pstr, CRLF, ts_conn->sizei); // "\r\n"
//    if(pnext != NULL) *pnext = '\0';
    if(pnext == NULL) {
       CurHTTP->httpStatus = 400; // 400 Bad Request
       return false;
    };
    pnext += 2;
    if(pnext - pstr < MIN_REQ_LEN) return false; // 501 размер строки запроса менее "GET /"
    if(os_strncmp(pstr, "GET ", 4) == 0) {
      SetSCB(SCB_GET);
      CurHTTP->httpStatus = 200;
      pstr += 4;
    }
    else if(os_strncmp(pstr, "POST ", 5) == 0) {
      SetSCB(SCB_POST);
      CurHTTP->httpStatus = 200;
      pstr += 5;
    }
    else return false;  // 501 Not Implemented (not a GET or POST command)
	CurHTTP->puri = pstr;
	CurHTTP->uri_len = pnext - pstr;

	if(CurHTTP->uri_len > 10) {  // "/ HTTP/1.0\r\n"
		pstr = web_strnstr(CurHTTP->puri, " HTTP/", CurHTTP->uri_len);
		if(pstr != NULL) {
			if((pstr[7] == '.')&&(pstr[6] <= '9')&&(pstr[6] >= '0')&&(pstr[8] >= '0')&&(pstr[8] <= '9'))
				CurHTTP->httpver = ((pstr[6]-'0')<<4) + pstr[8]-'0';
			// else CurHTTP->ver = 0x00;
		};
	};
#if DEBUGSOO > 3
	os_printf("http_ver=%02x ", CurHTTP->httpver);
#endif
	if(CurHTTP->httpver < 0x10) { // HTTP/0.9 ?
		if(CheckSCB(SCB_POST)) {
			CurHTTP->httpStatus = 400; // 400 HTTP/0.9 does not support POST
			return false; // HTTP/0.9
	    };
	};
	// здесь уже надо глядеть - следует или нет докачивать данные
	pstr = web_strnstr(pnext-2, CRLF CRLF, pend - pnext + 2 ); // find "\r\n\r\n"
	if(pstr == NULL) return true; // докачивать!
	// разбираем дальше Header, раз уже скачан
	pstr += 2;
	if(pstr != pnext) { // есть Headers
		CurHTTP->phead = pnext;
		CurHTTP->head_len = pstr - pnext;
		if(CheckSCB(SCB_POST)){
			pstr += 2;
			CurHTTP->pcontent = pstr;
			CurHTTP->content_len = pend - pstr;
		};
	};
	if(!CheckSCB(SCB_FOPEN)) { // файл уже открыт? нет
		web_parse_fname(CurHTTP, ts_conn);
		if(!webserver_open_file(CurHTTP, ts_conn)) {
			CurHTTP->httpStatus = 404; // "404: File not found"
			return false; //
		};
	};
	if((CurHTTP->phead == NULL)||(CurHTTP->head_len == 0)) {
		// если требуется авторизация, но нет передачи пароля...
		if(CheckSCB(SCB_AUTH)) CurHTTP->httpStatus = 401; // 401 Unauthorized
		return false; // нет Header
	};
	if(CheckSCB(SCB_POST)) {
    	pstr = head_find_ctr(CurHTTP, HTTPContentLength, sizeHTTPContentLength, 1);
    	if(pstr == NULL || CurHTTP->httpStatus != 200) {
    		CurHTTP->httpStatus = 411; // no "Content Length:", 411 Length Required
    		return false;
    	}
        uint32 cnlen = atoi(pstr);
#if DEBUGSOO > 1
        os_printf("content_len = %d of %d ", cnlen, CurHTTP->content_len);
#endif
        if(cnlen) {
    		web_conn->content_len = cnlen; // запомнить размер, для приема файла
        	if(!CheckSCB(SCB_BNDR) && (CurHTTP->head_len > sizeHTTPContentType + sizeHTTPmultipartformdata + sizeHTTPboundary + 2 + 2)) { //"x\r\n"
            	pstr = head_find_ctr(CurHTTP, HTTPContentType, sizeHTTPContentType, sizeHTTPmultipartformdata + sizeHTTPboundary + 2);
            	if(CurHTTP->httpStatus != 200) return false;
            	if(pstr != NULL) {
            		pend = web_strnstr(pstr, CRLF, CurHTTP->phead + CurHTTP->head_len - pstr);
                    pstr = web_strnstr(pstr, HTTPmultipartformdata, pend - pstr);
                    if(pstr != NULL) {
                    	pstr += sizeHTTPmultipartformdata;
                        pstr = web_strnstr(pstr, HTTPboundary, pend - pstr);
                        if(pstr != NULL) {
                        	// сохраним этот "мультипаспорт" (с) 5-ый элемент :)
                   			pstr += sizeHTTPboundary;
                   			HTTP_UPLOAD *pupload = (HTTP_UPLOAD *)os_zalloc(sizeof(HTTP_UPLOAD));
                   			if(pupload == NULL) {
                   				CurHTTP->httpStatus =  500; // 500 Internal Server Error
                   				return false;
                   			}
                        	uint8 x = *pend;
                        	*pend = '\0';
#if DEBUGSOO > 4
                        	os_printf("[%s] ", pstr);
#endif
                   			os_memcpy(pupload->boundary, pstr, MAXLENBOUNDARY);
                        	*pend = x;
                   			pupload->sizeboundary = os_strlen(pupload->boundary);
                   			ts_conn->pbufo = (uint8 *)pupload;
                   			SetSCB(SCB_BNDR);
//                          if(cnlen > ((pupload->sizeboundary * 2) + 18)) {
                        		SetSCB(SCB_RXDATA);
//                          }
                        };
                    };
            	};
            };
        	if((!CheckSCB(SCB_BNDR)) && cnlen > CurHTTP->content_len) { // обычный контент и недокачан заголовок? да.
        		CurHTTP->content_len = cnlen;
#if DEBUGSOO > 2
            	os_printf("wait content ");
#endif
        		CurHTTP->httpStatus = 413; // 413 Request Entity Too Large // пока так
        		return true; // докачивать
           	};
        }
        else CurHTTP->content_len = cnlen; // уточнить, что Content Length = 0
    };
    if(CheckSCB(SCB_AUTH)) {
    	pstr = head_find_ctr(CurHTTP, HTTPAuthorization, sizeHTTPAuthorization, 5 + 3); // "Authorization: Basic 1234\r\n"
    	if(pstr == NULL || CurHTTP->httpStatus != 200) {
    		CurHTTP->httpStatus = 401; // 401 Unauthorized
    		return false;
    	}
        if(os_strncmp(pstr, "Basic", 5) == 0) { // The authorization method and a space i.e. "Basic" is then put before the encoded string.
        	pstr += 5;
        	while(*pstr == ' ') pstr++;
        	if(CheckAuthorization(pstr)) ClrSCB(SCB_AUTH);
            else {
    	   		CurHTTP->httpStatus = 401; // 401 Unauthorized
    	   		return false;
    		};
        }
        else {
	   		CurHTTP->httpStatus = 401; // 401 Unauthorized
	   		return false;
		};
    };

    if(CurHTTP->head_len > sizeHTTPCookie + 4) { // "Cookie: a=\r\n"
    	pstr = head_find_ctr(CurHTTP, HTTPCookie, sizeHTTPCookie, 2);
        if(pstr != NULL) {
    		pend = web_strnstr(pstr, CRLF, CurHTTP->phead + CurHTTP->head_len - pstr);
        	if(pend != NULL) {
        		CurHTTP->pcookie = pstr;
        		CurHTTP->cookie_len = pend - pstr;
#if DEBUGSOO > 3
        		*pend = '\0';
				os_printf("cookie:[%s] ", pstr);
        		*pend = '\r';
#endif
        	}
#if DEBUGSOO > 3
           	else os_printf("cookie not crlf! ");
#endif

