pvvx/esp8266web/app/web/web_srv.c
        };
    };
#ifdef WEBSOCKET_ENA
    if(CheckSCB(SCB_GET)) {
        if(CurHTTP->head_len > sizeHTTPUpgrade +  sizeHTTPwebsocket + 2 + sizeHTTPSecWebSocketKey + sizeWebSocketKey + 2) { // + "\r\n"
        	pstr = head_find_ctr(CurHTTP, HTTPUpgrade, sizeHTTPUpgrade, sizeHTTPwebsocket);
        	if(CurHTTP->httpStatus != 200) return false;
        	if(pstr != NULL) {
            	if(os_memcmp(pstr, HTTPwebsocket, sizeHTTPwebsocket)) {
                    CurHTTP->httpStatus = 400; // 400 Bad Request
                    return false;
            	}
            	pstr = head_find_ctr(CurHTTP, HTTPSecWebSocketKey, sizeHTTPSecWebSocketKey, sizeWebSocketKey);
            	if(pstr == NULL || CurHTTP->httpStatus != 200) return false;
            	{
            		if(WebSocketAcceptKey(CurHTTP->pFilename, pstr)) SetSCB(SCB_WEBSOC);
            	}
        	}
        }
    }
#endif
    return false;
}
/******************************************************************************
 * FunctionName : web_inc_fp
 * Parameters   : fp
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR web_inc_fp(WEB_SRV_CONN *web_conn, WEBFS_HANDLE fp)
{
	if(web_conn->bffiles[3] != WEBFS_INVALID_HANDLE) {
	#if DEBUGSOO > 1
		os_printf("cf%d ", web_conn->bffiles[3]);
	#endif
		if(web_conn->bffiles[3] <= WEBFS_MAX_HANDLE) {
			web_conn->content_len -= WEBFSGetBytesRem(web_conn->bffiles[3]);
			WEBFSClose(web_conn->bffiles[3]);
		}
	};
    web_conn->bffiles[3] = web_conn->bffiles[2];
    web_conn->bffiles[2] = web_conn->bffiles[1];
    web_conn->bffiles[1] = web_conn->bffiles[0];
	web_conn->bffiles[0] = fp;
	SetSCB(SCB_FOPEN); // файл открыт
}
/******************************************************************************
 * FunctionName : web_inc_fopen
 * Description  : web include file open
 * Parameters   : struct
 * Returns      : true - open OK
*******************************************************************************/
bool ICACHE_FLASH_ATTR web_inc_fopen(TCP_SERV_CONN *ts_conn, uint8 *cFile)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	if(CheckSCB(SCB_FOPEN) && (!CheckSCB(SCB_FCALBACK))) { // файл уже открыт и он не парсится?
	    return false; // такое не поддерживается в "~inc:filename~"
	};
	WEBFS_HANDLE fp = WEBFSOpen(cFile);
#if DEBUGSOO > 1
	os_printf("of%d[%s] ", fp, cFile);
#endif
	if(fp != WEBFS_INVALID_HANDLE) {
		if(fatCache.flags & WEBFS_FLAG_HASINDEX) SetSCB(SCB_FCALBACK); // файл надо парсить
		web_conn->content_len += WEBFSGetBytesRem(fp); // указать размер файла для вывода
		if(fatCache.flags & WEBFS_FLAG_ISZIPPED) {
			if(CheckSCB(SCB_FOPEN)) { // файл уже открыт и "~inc:filename~" не поддерживает GZIP!
				WEBFSClose(fp);
#if DEBUGSOO > 1
				os_printf("Not inc GZIP! ");
#endif
				return false;
			};
			SetSCB(SCB_FGZIP); // файл сжат GZIP
		}
	}
	else { // File not found
	    return false;
	};
	web_inc_fp(web_conn, fp);
	return true;
};
/******************************************************************************
 * FunctionName : web_inc_file
 * Description  : web include file close
 * Parameters   : struct
 * Returns      : true - все файлы закрыты
*******************************************************************************/
bool ICACHE_FLASH_ATTR web_inc_fclose(WEB_SRV_CONN *web_conn)
{
	if(web_conn->bffiles[0] != WEBFS_INVALID_HANDLE) {
#if DEBUGSOO > 1
		os_printf("cf%d ", web_conn->bffiles[0]);
#endif
		if(web_conn->bffiles[0] <= WEBFS_MAX_HANDLE) {
			WEBFSClose(web_conn->bffiles[0]);
			ClrSCB(SCB_FGZIP);
		}
        web_conn->bffiles[0] = web_conn->bffiles[1];
        web_conn->bffiles[1] = web_conn->bffiles[2];
        web_conn->bffiles[2] = web_conn->bffiles[3];
        web_conn->bffiles[3] = WEBFS_INVALID_HANDLE;
   		if(web_conn->bffiles[0] != WEBFS_INVALID_HANDLE) return false;
	};
	ClrSCB(SCB_FOPEN | SCB_FGZIP | SCB_FCALBACK);
	return true; // больше нет файлов
};
/******************************************************************************
 * FunctionName : webserver_open_file
 * Description  : Compare to known extensions to determine Content-Type
 * Parameters   : filename -- file name
 * Returns      : 1 - open, 0 - no
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR webserver_file_ext(HTTP_CONN *CurHTTP, uint8 *pfname)
{
	uint8 *pfext = NULL;
	while(*pfname >= ' ') if(*pfname++ == '.') pfext = pfname;
	if(pfext != NULL) {
		for(CurHTTP->fileType = HTTP_TXT; CurHTTP->fileType < HTTP_UNKNOWN; CurHTTP->fileType++)
			if(rom_xstrcmp(pfext, httpFileExtensions[CurHTTP->fileType]))	break;
	};
}
/*----------------------------------------------------------------------*/
#ifdef USE_CAPTDNS
LOCAL bool ICACHE_FLASH_ATTR web_cdns_no_redir(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	if(syscfg.cfg.b.cdns_ena
	  && pcb_cdns != NULL
	  &&((ts_conn->pcb->remote_ip.addr ^ info.ap_ip) & info.ap_mask) == 0
	  && CurHTTP->phead != NULL
	  && CurHTTP->head_len != 0) {
		uint8 * ps = head_find_ctr(CurHTTP, HTTPHost, sizeHTTPHost, 7);
		if(ps != NULL) {
#if DEBUGSOO > 1
		os_printf("Host: '%s' ", ps);
#endif
		if(rom_xstrcmp(ps, HostNameLocal) == 0)  {
				ets_sprintf(CurHTTP->pFilename, httpHostNameLocal, HostNameLocal); // "http://esp8266/"
				WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
				SetSCB(SCB_REDIR);
				return false;
			}
		}
	}
	return true;
}
#endif
/******************************************************************************
 * FunctionName : webserver_open_file
 * Description  : Open file
 * Parameters   : filename -- file name
 * Returns      : 1 - open, 0 - no
*******************************************************************************/
LOCAL bool ICACHE_FLASH_ATTR webserver_open_file(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	uint8 pbuf[MAX_FILE_NAME_SIZE];
	uint8 *pstr = pbuf;
	if(CurHTTP->pFilename[0] == '/') {
		if(CurHTTP->pFilename[1] == '\0') {
			if(isWEBFSLocked) {
				web_inc_fp(web_conn, WEBFS_NODISK_HANDLE);
				web_conn->content_len = sizeHTTPdefault;
				CurHTTP->fileType = HTTP_HTML;
#if DEBUGSOO > 1
				os_printf("of%d[%s] ", web_conn->webfile, CurHTTP->pFilename);
#endif
				return true;
			}
			else {
#ifdef USE_CAPTDNS
				if(web_cdns_no_redir(CurHTTP, ts_conn)) rom_xstrcpy(pstr, http_default_file);
				else return false;
#else
				rom_xstrcpy(pstr, http_default_file);
#endif
			}
		}
		else {
			os_memcpy(pstr, &CurHTTP->pFilename[1], MAX_FILE_NAME_SIZE-1);
			if(rom_xstrcmp(pstr, web_cgi_fname)) {
				web_inc_fp(web_conn, WEBFS_WEBCGI_HANDLE);
				web_conn->content_len = sizeHTTPdefault;
				CurHTTP->fileType = HTTP_HTML;
#if DEBUGSOO > 1
				os_printf("of%d[%s] ", web_conn->webfile, CurHTTP->pFilename);
#endif
				return true;
			}
			else if(rom_xstrcmp(pstr, fsupload_fname)) {
				SetSCB(SCB_AUTH);
				web_inc_fp(web_conn, WEBFS_UPLOAD_HANDLE);
				web_conn->content_len = sizeHTTPfsupload;
				CurHTTP->fileType = HTTP_HTML;
#if DEBUGSOO > 1
				os_printf("of%d[%s] ", web_conn->webfile, CurHTTP->pFilename);
#endif
				return true;
			}
		}
		if(isWEBFSLocked) return false;
		// поиск файла на диске
		if(!web_inc_fopen(ts_conn, pstr)) {
			uint16 i = os_strlen(pbuf);
			if(i + sizeof(http_default_file) < MAX_FILE_NAME_SIZE - 1) {
				// добавить к имени папки "/index.htm"
				pbuf[i] = '/';
				rom_xstrcpy(&pbuf[i+1], http_default_file);
				if(!web_inc_fopen(ts_conn, pstr)) {
#ifdef USE_CAPTDNS
					web_cdns_no_redir(CurHTTP, ts_conn);
#endif
					return false;
				}
			};
		};
		// Compare to known extensions to determine Content-Type
		webserver_file_ext(CurHTTP, pstr);
		return true;
	};
	return false; // файл не открыт
}
/******************************************************************************
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR web_send_fnohanle(TCP_SERV_CONN *ts_conn) {
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	uint32 pdata = 0;
	uint8 pbuf[mMAX(sizeHTTPdefault,sizeHTTPfsupload)];
	uint16 size = 0;
	switch(web_conn->webfile) {
	case WEBFS_NODISK_HANDLE:
	case WEBFS_WEBCGI_HANDLE:
		pdata = (uint32)((void *)HTTPdefault);
		size = sizeHTTPdefault;
		break;
	case WEBFS_UPLOAD_HANDLE:
		pdata = (uint32)((void *)HTTPfsupload);
		size = sizeHTTPfsupload;
		break;
	}
	if(pdata != 0 && size != 0) {
		spi_flash_read(pdata & MASK_ADDR_FLASH_ICACHE_DATA, pbuf, size);
		tcpsrv_int_sent_data(ts_conn, pbuf, size);
	}
#if DEBUGSOO > 1
	os_printf("%u ", size);
#endif
	SetSCB(SCB_FCLOSE|SCB_DISCONNECT);
}
/******************************************************************************
*******************************************************************************/
LOCAL int ICACHE_FLASH_ATTR web_find_cbs(uint8 * chrbuf, uint16 len) {
  int i;
  for(i = 0; i < len; i++)  if(chrbuf[i] == '~')  return i;
  return -1;
}
/******************************************************************************
 * FunctionName : webserver_send_fdata
 * Description  : Sent callback function to call for this espconn when data
 *                is successfully sent
 * Parameters   : arg -- Additional argument to pass to the callback function
 * Returns      : none
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR webserver_send_fdata(TCP_SERV_CONN *ts_conn) {
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	if(web_conn->webfile == WEBFS_INVALID_HANDLE) {
		SetSCB(SCB_FCLOSE|SCB_DISCONNECT);
		return;
	}
#if DEBUGSOO > 1
	os_printf("send: ");
#endif
	set_cpu_clk();

	web_conn->msgbufsize = tcp_sndbuf(ts_conn->pcb);

