pvvx/esp8266web/app/web/web_srv.c
#if DEBUGSOO > 5
	os_printf("sndbuf=%u ", web_conn->msgbufsize);
#endif

	if (web_conn->msgbufsize < MIN_SEND_SIZE) {
#if DEBUGSOO > 1
		os_printf("sndbuf=%u! ", web_conn->msgbufsize);
		if(ts_conn->flag.wait_sent) os_printf("wait_sent! "); // блок передан?
#endif
		ts_conn->pcb->flags &= ~TF_NODELAY;
		tcpsrv_int_sent_data(ts_conn, (uint8 *)ts_conn, 0);
		return;
	}

	if((web_conn->webfile > WEBFS_MAX_HANDLE)&&(!CheckSCB(SCB_RETRYCB)))  {
		web_send_fnohanle(ts_conn);
		return;
	}
	web_conn->msgbufsize = mMIN(MAX_SEND_SIZE, web_conn->msgbufsize);
	uint8 *pbuf = (uint8 *) os_malloc(web_conn->msgbufsize);
	if (pbuf == NULL) {
#if DEBUGSOO > 0
		os_printf("out of memory - disconnect!\n");
#endif
		SetSCB(SCB_FCLOSE|SCB_DISCONNECT);
		return;
	};
	web_conn->msgbuf = pbuf;
	web_conn->msgbuflen = 0;
	if (CheckSCB(SCB_CHUNKED)) { // is chunked
		web_conn->msgbuf += RESCHKS_SEND_SIZE;
		web_conn->msgbufsize -= RESCHK_SEND_SIZE;
	};
	if(CheckSCB(SCB_FCALBACK) == 0) { // передача файла без парсинга
		// Get/put as many bytes as possible
		web_conn->msgbuflen = WEBFSGetArray(web_conn->webfile, web_conn->msgbuf, web_conn->msgbufsize);
		if(web_conn->msgbuflen < web_conn->msgbufsize ) SetSCB(SCB_FCLOSE | SCB_DISCONNECT);
	}
	else { // парсинг потока передачи
		do { // начинаем с пустого буфера
			if(CheckSCB(SCB_RETRYCB)) { // повторный callback? да
#if DEBUGSOO > 2
				os_printf("rcb ");
#endif
				if(web_conn->func_web_cb != NULL) web_conn->func_web_cb(ts_conn);
				if(CheckSCB(SCB_RETRYCB)) break; // повторить ещё раз? да.
			}
			else {
				uint8 *pstr = &web_conn->msgbuf[web_conn->msgbuflen]; // указатель в буфере
				// запомнить указатель в файле. ftell(fp)
				uint16 max = mMIN(web_conn->msgbufsize - web_conn->msgbuflen, SCB_SEND_SIZE); // читаем по 128 байт ?
				uint16 len = WEBFSGetArray(web_conn->webfile, pstr, max);
				// прочитано len байт в буфер по указателю &sendbuf[msgbuflen]
				if(len) { // есть байты для передачи, ищем string "~calback~"
					int cmp = web_find_cbs(pstr, len);
					if(cmp >= 0) { // найден calback
						// откат файла
						WEBFSStubs[web_conn->webfile].addr -= len;
						WEBFSStubs[web_conn->webfile].bytesRem += len;
						// передвинуть указатель в файле на считанные байты с учетом маркера, без добавки длины для передачи
						WEBFSStubs[web_conn->webfile].addr += cmp+1;
						WEBFSStubs[web_conn->webfile].bytesRem -= cmp+1;
						// это второй маркер?
						if(CheckSCB(SCB_FINDCB)) { // в файле найден закрывающий маркер calback
							ClrSCB(SCB_FINDCB); // прочитали string calback-а
							if(cmp != 0) { // это дубль маркера ? нет.
								// запустить calback
								pstr[cmp] = '\0'; // закрыть string calback-а
								if(!os_memcmp((void*)pstr, "inc:", 4)) { // "inc:file_name"
									if(!web_inc_fopen(ts_conn, &pstr[4])) {
										tcp_strcpy_fd("file not found!");
									};
								}
								else web_int_callback(ts_conn);
							}
							else { // Дубль маркера.
								web_conn->msgbuflen++; // передать только маркер ('~')
							};
						}
						else {
							SetSCB(SCB_FINDCB); // в файле найден стартовый маркер calback
							web_conn->msgbuflen += cmp;  // передать до стартового маркера calback
						};
					}
					else {  // просто данные
						ClrSCB(SCB_FINDCB);
						if(len < max) {
							if(web_inc_fclose(web_conn)) SetSCB(SCB_FCLOSE | SCB_DISCONNECT); // файл(ы) закончилсь совсем? да.
						};
						web_conn->msgbuflen += len; // добавить кол-во считанных байт для передачи.
					};
				}
				else if(web_inc_fclose(web_conn)) SetSCB(SCB_FCLOSE | SCB_DISCONNECT); // файл(ы) закончилсь совсем? да.
			};  // not SCB_RETRYCB
		} // набираем буфер
		while((web_conn->msgbufsize - web_conn->msgbuflen >= SCB_SEND_SIZE)&&(!CheckSCB(SCB_FCLOSE | SCB_RETRYCB | SCB_DISCONNECT)));
	};
#if DEBUGSOO > 3
	os_printf("#%04x %d ", web_conn->webflag, web_conn->msgbuflen);
#elif DEBUGSOO > 1
	os_printf("%u ", web_conn->msgbuflen);
#endif
	if(web_conn->msgbuflen) {
		web_conn->content_len -= web_conn->msgbuflen; // пока только для инфы
		if(CheckSCB(SCB_CHUNKED)) { // greate chunked
			uint8 cbuf[16];
			static const char chunks[] ICACHE_RODATA_ATTR = "\r\n%X\r\n";
			unsigned int len = ets_sprintf(cbuf, chunks, web_conn->msgbuflen);
			web_conn->msgbuf -= len;
			os_memcpy(web_conn->msgbuf, cbuf, len);
			web_conn->msgbuflen += len;
			if(CheckSCB(SCB_FCLOSE)) { // close file? -> add 'end chunked'
				tcp_strcpy_fd("\r\n0\r\n\r\n");
			};
		};
		ts_conn->pcb->flags |= TF_NODELAY;
		tcpsrv_int_sent_data(ts_conn, web_conn->msgbuf, web_conn->msgbuflen);
	};
	os_free(pbuf);
	web_conn->msgbuf = NULL;
}
/******************************************************************************
 * FunctionName : web_print_headers
 * Description  : Print HTTP Response Header
 * Parameters   : *
 * Returns      : none
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR
web_print_headers(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	HTTP_RESPONSE *CurResp = (HTTP_RESPONSE *)HTTPResponse;
#if DEBUGSOO > 3
    os_printf("prh#%04x,%d,%d ", web_conn->webflag, CurHTTP->httpStatus, CurHTTP->fileType);
#endif
    web_conn->msgbuf = (uint8 *)os_malloc(HTTP_SEND_SIZE);
    if(web_conn->msgbuf == NULL)
    {
#if DEBUGSOO == 1
        os_printf("web: out of memory!\n");
#elif DEBUGSOO > 1
        os_printf("out of memory! ");
#endif
    	SetSCB(SCB_FCLOSE | SCB_DISCONNECT);
        return;
    }
    web_conn->msgbufsize = HTTP_SEND_SIZE;
    web_conn->msgbuflen = 0;

    if(CheckSCB(SCB_REDIR)) {
    	CurHTTP->httpStatus = 302; // редирект
    }
	while(!(CurResp->flag & HTTP_RESP_FLG_END)) {
      if(CurResp->status == CurHTTP->httpStatus) break;
      CurResp++;
    };
    tcp_puts_fd("HTTP/1.1 %u ", CurResp->status);
    tcp_strcpy(CurResp->headers);
    tcp_strcpy_fd("\r\nServer: " WEB_NAME_VERSION "\r\nConnection: close\r\n");
    if(CheckSCB(SCB_REDIR)) {
    	tcp_puts_fd("Location: %s\r\n\r\n", CurHTTP->pFilename);
    	ts_conn->flag.pcb_time_wait_free = 1; // закрыть соединение
    	SetSCB(SCB_DISCONNECT);
    }
    else {
        if(CurResp->status != 200) {
        	web_inc_fclose(web_conn);
        	ClrSCB(SCB_FCALBACK | SCB_FGZIP | SCB_CHUNKED | SCB_RXDATA | SCB_FCLOSE);
            if(CurResp->flag & HTTP_RESP_FLG_FINDFILE) {
              os_sprintf_fd(CurHTTP->pFilename, "/%u.htm", CurResp->status);
              webserver_open_file(CurHTTP, ts_conn);
        //      CurHTTP->httpStatus = CurResp->status; // вернуть статус!
            };
        }
        if((!CheckSCB(SCB_FOPEN)) && (CurResp->default_content != NULL) ) {
            tcp_puts_fd("%s %u\r\n%s %s\r\n\r\n", HTTPContentLength, rom_strlen(CurResp->default_content),
              HTTPContentType, httpContentTypes[HTTP_TXT]);
            tcp_strcpy(CurResp->default_content);
            SetSCB(SCB_DISCONNECT);
        }
        else if(CheckSCB(SCB_FOPEN)) {
        	if(web_conn->content_len) {
            	// Указать, что данные могут пользовать все (очень актуально для XML)
        		tcp_strcpy_fd("Access-Control-Allow-Origin: *\r\n");
                if(CurHTTP->fileType != HTTP_UNKNOWN) {
                	if(web_conn->bffiles[0] == WEBFS_WEBCGI_HANDLE && CheckSCB(SCB_FCALBACK)) CurHTTP->fileType = HTTP_TXT;
                	tcp_puts_fd("Content-Type: %s\r\n", httpContentTypes[CurHTTP->fileType]);
                };
                // Output the cache-control + ContentLength
                if(CheckSCB(SCB_FCALBACK)) { // длина неизветсна
                	// file is callback index
                	tcp_strcpy_fd("Cache-Control: no-store, no-cache, must-revalidate, max-age=0\r\n");
                	if(CurHTTP->httpver >= 0x11) SetSCB(SCB_CHUNKED);
                }
                else { // длина изветсна
                	tcp_puts_fd("%s %d\r\n", HTTPContentLength, web_conn->content_len);
                	if(CurResp->status == 200 && (!isWEBFSLocked) && web_conn->bffiles[0] != WEBFS_WEBCGI_HANDLE) {
                		// lifetime (sec) of static responses as string 60*60*24*14=1209600"
                    	tcp_puts_fd("Cache-Control: smax-age=%d\r\n", FILE_CACHE_MAX_AGE_SEC);
                	}
                	else {
                		tcp_strcpy_fd("Cache-Control: no-store, no-cache, must-revalidate, max-age=0\r\n");
                	}
                };
                if(CheckSCB(SCB_FGZIP)) {
                	// Output the gzip encoding header if needed
                	tcp_strcpy_fd("Content-Encoding: gzip\r\n");
                }
                else if(CheckSCB(SCB_CHUNKED)) {
                	tcp_strcpy_fd("Transfer-Encoding: chunked\r\n");
                }
                if(!CheckSCB(SCB_CHUNKED)) tcp_strcpy_fd(CRLF);
            }
            else {
            	tcp_puts_fd("%s 0\r\n\r\n", HTTPContentLength);
            	SetSCB(SCB_FCLOSE|SCB_DISCONNECT);
            }
        }
        else SetSCB(SCB_DISCONNECT);
    }
#if DEBUGSOO > 3
    os_printf("#%04x (%d) %d ", web_conn->webflag, web_conn->msgbuflen, CurHTTP->httpStatus);
#elif DEBUGSOO > 1
    os_printf("head[%d]:%d ", web_conn->msgbuflen, CurHTTP->httpStatus);
#endif
    if(web_conn->msgbuflen) {
        if(CheckSCB(SCB_DISCONNECT)) SetSCB(SCB_CLOSED);
        tcpsrv_int_sent_data(ts_conn, web_conn->msgbuf, web_conn->msgbuflen);
#ifdef USE_WEB_NAGLE
        ts_conn->flag.nagle_disabled = 1;
#endif
    };
    os_free(web_conn->msgbuf);
    web_conn->msgbuf = NULL;
}
/******************************************************************************/
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// поиск boundary
// 0 - разделитель (boundary) не найден, докачивать или ...
// 1 - boundary найден
// 200 - найден завершаюший boundary
// 400 - неверный формат
// ...
//-----------------------------------------------------------------------------
/* Пример M-Explorer: Load blk len: 399
-----------------------------7df22f37711be\r\n
Content-Disposition: form-data; name="test"; filename="readme.txt"\r\n
Content-Type: text/plain\r\n\r\n
1234567890\r\n
-----------------------------7df22f37711be\r\n
Content-Disposition: form-data; name="start"\r\n\r\n
0x1B000\r\n
-----------------------------7df22f37711be\r\n
Content-Disposition: form-data; name="stop"\r\n\r\n
0x1B000\r\n
-----------------------------7df22f37711be--\r\n */
/* Пример Google Chrome: Load blk len: 391
------WebKitFormBoundaryugGNBVFOk6qxfe22\r\n
Content-Disposition: form-data; name="test"; filename="readme.txt"\r\n
Content-Type: text/plain\r\n\r\n
1234567890\r\n
------WebKitFormBoundaryugGNBVFOk6qxfe22\r\n
Content-Disposition: form-data; name="start"\r\n\r\n
0x1B000\r\n
------WebKitFormBoundaryugGNBVFOk6qxfe22\r\n
Content-Disposition: form-data; name="stop"\r\n\r\n
0x1B000\r\n
------WebKitFormBoundaryugGNBVFOk6qxfe22--\r\n */
//-----------------------------------------------------------------------------
const char crlf_end_boundary[] ICACHE_RODATA_ATTR = "--" CRLF;
LOCAL int ICACHE_FLASH_ATTR find_boundary(HTTP_UPLOAD *pupload, uint8 *pstr, uint16 len)
{
	int x = len - 6 - pupload->sizeboundary;
	if(x <= 0) return 0; // разделитель (boundary) не найден - докачивать буфер
	int i;
	uint8 *pcmp;
	for(i = 0; i <= x; i++) {
		if(pstr[i] == '-' && pstr[i+1] == '-') {
			pcmp = pstr + i;
//			if((pstr + len - pcmp) < pupload->sizeboundary + 6) return 0; // разделитель (boundary) не найден - докачивать буфер
			pupload->pbndr = pcmp; // указатель на заголовок boundary (конец блока данных);
			pcmp += 2;
			if(os_memcmp(pcmp, pupload->boundary, pupload->sizeboundary)) return 0; // разделитель (boundary) не найден
			pcmp += pupload->sizeboundary;
			if(rom_xstrcmp(pcmp, crlf_end_boundary)) {
				pcmp += 4;
				pupload->pnext = pcmp; // указатель в заголовке boundary (описание новых данных);
				return 200; // найден завершающий разделитель
			}
			if(pcmp[0] != '\r' || pcmp[1] != '\n') return 400; // неверный формат
			pcmp += 2;
			pupload->pnext = pcmp; // указатель в заголовке boundary (описание новых данных);
			return 1;
		};
	};
	return 0; // разделитель (boundary) не найден - докачивать буфер
}
//-----------------------------------------------------------------------------
// Function: cmp_next_boundary
// return:
// 0 - разделитель (boundary) не найден, докачивать
// 1 - далее обработка данных
// 200 - найден завершающий разделитель: "\r\n--boundary--"
// 400 - неизвестный формат content-а
//-----------------------------------------------------------------------------
const char disk_ok_filename[] ICACHE_RODATA_ATTR = "/disk_ok.htm";
const char disk_err1_filename[] ICACHE_RODATA_ATTR = "/disk_er1.htm";
const char disk_err2_filename[] ICACHE_RODATA_ATTR = "/disk_er2.htm";
const char disk_err3_filename[] ICACHE_RODATA_ATTR = "/disk_er3.htm";
const char sysconst_filename[] ICACHE_RODATA_ATTR = "sysconst";
const char sector_filename[] ICACHE_RODATA_ATTR = "fsec_";
#define sector_filename_size 5
const char file_label[] ICACHE_RODATA_ATTR = "file";

