pvvx/esp8266web/app/web/web_srv.c
LOCAL int ICACHE_FLASH_ATTR upload_boundary(TCP_SERV_CONN *ts_conn) // HTTP_UPLOAD pupload, uint8 pstr, uint16 len)
{
	HTTP_UPLOAD *pupload = (HTTP_UPLOAD *)ts_conn->pbufo;
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	if(pupload == NULL) return 500; // ошибка сервера
	uint16 ret;
	uint16 len;
	uint8 *pnext;
	uint8 *pstr;
	while(web_conn->content_len && ts_conn->pbufi != NULL) {
		pstr = ts_conn->pbufi;
		len = ts_conn->sizei;
#if DEBUGSOO > 4
		os_printf("bufi[%u]%u, cont:%u ", ts_conn->sizei, ts_conn->cntri, web_conn->content_len);
#endif
		if(len < (8 + pupload->sizeboundary)) return 0; // разделитель (boundary) не влезет - докачивать буфер
		switch(pupload->status) {
			case 0: // поиск boundary
			{
#if DEBUGSOO > 4
				os_printf("find_bndr ");
#endif
				pnext = web_strnstr(pstr, CRLF CRLF , len);
				if(pnext == NULL) return 0; // докачивать
				len = pnext - pstr;
				ret = find_boundary(pupload, pstr, len);
#if DEBUGSOO > 4
				os_printf("len=%u,ret=%u ", len, ret );
#endif
				if(ret != 1) return ret;
				pstr = pupload->pnext; // +"\r\n" адрес за заголовком boundary
				pupload->name[0] = '\0';
				pupload->filename[0] = '\0';
				pstr = web_strnstr(pstr, "name=", pnext - pstr);
				if(pstr == NULL) return 400; // неизвестный формат content-а
				pstr += 5;
				if(pstr >= pnext) return 400; // неизвестный формат content-а
				uint8 *pcmp = cmpcpystr(pupload->name, pstr, '"', '"', VarNameSize);
				if(pcmp == NULL) {
				 	pcmp = cmpcpystr(pupload->name, pstr, 0x22, 0x22, VarNameSize);
				 	if(pcmp == NULL) return 400; // неизвестный формат content-а
				};
				pstr = pcmp;
#if DEBUGSOO > 4
				os_printf("name:'%s' ", pupload->name);
#endif
				if(pstr >= pnext) return 400; // неизвестный формат content-а
				pcmp = web_strnstr(pstr, "filename=", pnext - pstr);
				if(pcmp != NULL) {
					pcmp += 9;
					if(pcmp < pnext) {
						if(cmpcpystr(pupload->filename, pcmp, '"', '"', VarNameSize) == NULL)
							cmpcpystr(pupload->filename, pcmp, 0x22, 0x22, VarNameSize);
					};
#if DEBUGSOO > 1
					if(pupload->filename[0]!= '\0') os_printf("filename:'%s' ", pupload->filename);
#endif
				};
				len += 4;
				pupload->status++;
#if DEBUGSOO > 4
					os_printf("trim#%u\n", len );
#endif
				ts_conn->cntri += len; // далее идут данные
				if(!web_trim_bufi(ts_conn, &ts_conn->pbufi[len], ts_conn->sizei - len)) return 500;
				web_conn->content_len -= len;
				break;
			}
			case 1: // прием данных, первый заход, проверка форматов и т.д.
			{
#if DEBUGSOO > 4
				os_printf("tst,fn='%s' ", pupload->filename);
#endif
				if(pupload->filename[0]!='\0') { // загрузка файла?
					if(rom_xstrcmp(pupload->name, file_label)) { // !os_memcmp((void*)pupload->name, "file", 4)
						if(len < sizeof(WEBFS_DISK_HEADER)) return 0; // докачивать
						WEBFS_DISK_HEADER *dhead = (WEBFS_DISK_HEADER *)pstr;
						if(dhead->id != WEBFS_DISK_ID || dhead->ver != WEBFS_DISK_VER
								|| (web_conn->content_len - pupload->sizeboundary - 8 < dhead->disksize)) {
							if(isWEBFSLocked) return 400;
							SetSCB(SCB_REDIR);
							rom_xstrcpy(pupload->filename, disk_err1_filename); // os_memcpy(pupload->filename,"/disk_er1.htm\0",14); // неверный формат
							return 200;
						};
						if(dhead->disksize > WEBFS_max_size()) {
							if(isWEBFSLocked) return 400;
							SetSCB(SCB_REDIR);
							rom_xstrcpy(pupload->filename, disk_err2_filename); // os_memcpy(pupload->filename,"/disk_er2.htm\0",14); // не влезет
							return 200;
						};
						pupload->fsize = dhead->disksize;
						pupload->faddr = WEBFS_base_addr();
#if DEBUGSOO > 4
						os_printf("updisk[%u]=ok,m=%u ", dhead->disksize, disk_max_size );
#endif
						pupload->status = 3; // = 3 загрузка WebFileSystem во flash
						isWEBFSLocked = true;
						break;
					}
					else if(rom_xstrcmp(pupload->name, sysconst_filename)) {
						pupload->fsize = SIZE_USYS_CONST;
						pupload->faddr = esp_init_data_default_addr;
						pupload->status = 2; // = 2 загрузка файла во flash
						break;
					}
					else if(rom_xstrcmp(pupload->name, sector_filename)){
						pupload->fsize = SPI_FLASH_SEC_SIZE;
						pupload->faddr = ahextoul(&pupload->name[sector_filename_size]) << 12;
						pupload->status = 2; // = 2 загрузка файла сектора во flash
						break;
					};
					if(isWEBFSLocked) return 400;
					SetSCB(SCB_REDIR);
					rom_xstrcpy(pupload->filename, disk_err3_filename); // os_memcpy(pupload->filename,"/disk_er3.htm\0",14); // неизвестный тип
					return 200;
				}
				else {
					uint8 *pcmp = web_strnstr(pstr, CRLF, len);
					if(pcmp == NULL) return 0; // докачивать
					ret = find_boundary(pupload, pstr, len);
#if DEBUGSOO > 4
					os_printf("ret=%u ", ret );
#endif
					if((ret != 1 && ret != 200)) { // не найден конец или новый boundary?
						return ret; // догружать
					}
					*pcmp = '\0';
					web_int_vars(ts_conn, pupload->name, pstr);
					if(ret == 200) return ret;
					// найден следующий boundary
					len = pupload->pbndr - ts_conn->pbufi;
					pupload->status = 0; // = 0 найден следующий boundary
#if DEBUGSOO > 4
					os_printf("trim#%u\n", len );
#endif
					ts_conn->cntri += len; // далее идут данные
					if(!web_trim_bufi(ts_conn, &ts_conn->pbufi[len], ts_conn->sizei - len)) return 500;
					web_conn->content_len -= len;
					break;
				}
//				return 400;
			}
//			default:
			case 2: // загрузка файла во flash
			case 3: // загрузка WebFileSystem во flash (скорость записи W25Q128 ~175 килобайт в сек, полный диск на 15,5МБ пишется 90..100 сек )
			{
#if DEBUGSOO > 4
				os_printf("fdata ");
#endif
				uint16 block_size = mMIN(max_len_buf_write_flash + 8 + pupload->sizeboundary, web_conn->content_len);
				if(ts_conn->sizei < block_size) return 0; // докачивать
				ret = find_boundary(pupload, pstr, block_size);
#if DEBUGSOO > 4
				os_printf("ret=%u ", ret);
#endif
				if((ret == 1 || ret == 200)) { // найден конец или новый boundary?
					len = mMIN(block_size, pupload->pbndr - 2 - ts_conn->pbufi);
				}
				else {
					len = mMIN(max_len_buf_write_flash, web_conn->content_len - 8 - pupload->sizeboundary);
				}
#if DEBUGSOO > 4
				os_printf("\nlen=%d, block_size=%d, content_len=%d, sizeboundary= %d, ret=%d, data = %d, load=%d", len, block_size, web_conn->content_len, pupload->sizeboundary, ret, pupload->pbndr - ts_conn->pbufi, ts_conn->sizei);
#endif
				if(pupload->fsize < len) block_size = pupload->fsize;
				else block_size = len;
#if (DEF_SDK_VERSION >= 1000) && (DEF_SDK_VERSION <= 1012)
#define SET_CPU_CLK_SPEED 1
				if(syscfg.cfg.b.hi_speed_enable) {
					ets_intr_lock();
					REG_CLR_BIT(0x3ff00014, BIT(0));
					os_update_cpu_frequency(80);
					ets_intr_unlock();
				}
#endif
				if(block_size) { // идут данные файла
//					tcpsrv_unrecved_win(ts_conn); // для ускорения, пока стрирается-пишется уже обновит окно (включено в web_rx_buf)
					if(pupload->faddr >= FLASH_MIN_SIZE && pupload->status == 3) {
						if((pupload->faddr & 0x0000FFFF)==0) {

#if DEBUGSOO > 2
							os_printf("Clear flash page addr %p... ", pupload->faddr);
#endif
							spi_flash_erase_block(pupload->faddr>>16);
						}
					}
					else if((pupload->faddr & 0x00000FFF) == 0) {
#if DEBUGSOO > 2
						os_printf("Clear flash sector addr %p... ", pupload->faddr);
#endif
						spi_flash_erase_sector(pupload->faddr>>12);
					}
#if DEBUGSOO > 2
					os_printf("Write flash addr:%p[0x%04x]\n", pupload->faddr, block_size);
#endif
					spi_flash_write(pupload->faddr, (uint32 *)pstr, (block_size + 3)&(~3));

					pupload->fsize -= block_size;
					pupload->faddr += block_size;
				}
#if DEBUGSOO > 4
				os_printf("trim#%u\n", len);
#endif
				if(len) {
					ts_conn->cntri += len;
					if(!web_trim_bufi(ts_conn, &ts_conn->pbufi[len], ts_conn->sizei - len)) return 500;
					web_conn->content_len -= len;
				}
#ifdef SET_CPU_CLK_SPEED
				if(syscfg.cfg.b.hi_speed_enable) set_cpu_clk();
#endif
				if((ret == 1 || ret == 200)) { // найден конец или новый boundary?
					if(pupload->status == 3) WEBFSInit();
					if(pupload->fsize != 0) {
						if(!isWEBFSLocked) {
							SetSCB(SCB_REDIR);
							rom_xstrcpy(pupload->filename, disk_err1_filename); // os_memcpy(pupload->filename,"/disk_er1.htm\0",14); // не всё передано или неверный формат
							return 200;
						}
						return 400; //  не всё передано или неверный формат
					}
					else {
						if(!isWEBFSLocked) {
							SetSCB(SCB_REDIR);
							rom_xstrcpy(pupload->filename, disk_ok_filename); // os_memcpy(pupload->filename,"/disk_ok.htm\0",13);
						};
					};
					if(ret == 1) pupload->status = 0; // = 0 найден следующий boundary
					if(ret == 200)	return ret;
				}
				break;
			};
		};
	};
	return 0; //
}
//-----------------------------------------------------------------------------
// web_rx_buf
//
//-----------------------------------------------------------------------------
#define MAX_NO_DATA_BUF_SIZE (8192)
LOCAL bool ICACHE_FLASH_ATTR web_rx_buf(HTTP_CONN *CurHTTP, TCP_SERV_CONN *ts_conn)
{
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	ts_conn->flag.rx_buf = 1; // указать, что всегда в режиме докачивать
//	CurHTTP->fileType = HTTP_UNKNOWN;
//	ts_conn->pbufi, ts_conn->cntri;
#if DEBUGSOO > 3
	os_printf("rx:%u[%u] ", web_conn->content_len, ts_conn->sizei);
#endif
	if(ts_conn->sizei == 0) return true; // докачивать
#ifdef WEBSOCKET_ENA
	if(CheckSCB(SCB_WEBSOC)) {
	 // прием ...

