pvvx/esp8266web/app/web/web_srv.c
	}
#endif
	tcpsrv_unrecved_win(ts_conn);
	int ret = upload_boundary(ts_conn);
	if(ret > 1) {
		CurHTTP->httpStatus = ret;
		web_conn->content_len = 0;
		if(ret == 200) {
			if(CheckSCB(SCB_REDIR)) {
				HTTP_UPLOAD *pupload = (HTTP_UPLOAD *)ts_conn->pbufo;
				if(pupload != NULL) {
					os_memcpy(CurHTTP->pFilename, pupload->filename, VarNameSize);
//					SetSCB(SCB_DISCONNECT);
				}
			}
			else if((!isWEBFSLocked) && CheckSCB(SCB_FOPEN)
					&& web_conn->webfile <= WEBFS_MAX_HANDLE
					&& WEBFSGetFilename(web_conn->webfile, CurHTTP->pFilename, FileNameSize)) {
					SetSCB(SCB_REDIR);
//					web_conn->content_len = WEBFSGetBytesRem(web_conn->webfile); // WEBFSGetSize(web_conn->webfile);
//					webserver_file_ext(CurHTTP, CurHTTP->pFilename);
//					return false; // ok 200 + file
			}
		}
		SetSCB(SCB_DISCONNECT);
		return false; // неизвестный content или end
	}
	else {
#if DEBUGSOO > 2
		os_printf("no boundary ");
#endif
		if(ts_conn->sizei > MAX_NO_DATA_BUF_SIZE) {
			CurHTTP->httpStatus = 418; // 418: Out of Coffee
			SetSCB(SCB_DISCONNECT);
			return false; // неизвестный content или end
		}
	};
	if(web_conn->content_len > ts_conn->cntri) return true; // докачивать
	CurHTTP->httpStatus = 400;
	SetSCB(SCB_DISCONNECT);
	web_conn->content_len = 0;
	return false; // неизвестный content
}
//-----------------------------------------------------------------------------
//--- web_trim_bufi -----------------------------------------------------------
//-----------------------------------------------------------------------------
LOCAL bool ICACHE_FLASH_ATTR web_trim_bufi(TCP_SERV_CONN *ts_conn, uint8 *pdata, uint16 data_len)
{
    if(pdata != NULL && data_len != 0 && ts_conn->sizei > data_len) {
        	os_memcpy(ts_conn->pbufi, pdata, data_len); // переместим кусок в начало буфера
        	ts_conn->pbufi = (uint8 *)mem_realloc(ts_conn->pbufi, data_len + 1); // mem_trim(ts_conn->pbufi, data_len + 1);
        	if(ts_conn->pbufi != NULL) {
            	ts_conn->sizei = data_len; // размер куска
            	ts_conn->cntri = 0;
        	}
        	else return false; // CurHTTP.httpStatus = 500; // 500 Internal Server Error
    }
    else if(ts_conn->pbufi != NULL) {
		os_free(ts_conn->pbufi);
		ts_conn->pbufi = NULL;
		ts_conn->sizei = 0;
		ts_conn->cntri = 0;
	};
    return true;
}
/******************************************************************************
 * web_feee_bufi
 *  освободить приемный буфер
*******************************************************************************/
LOCAL bool ICACHE_FLASH_ATTR web_feee_bufi(TCP_SERV_CONN *ts_conn)
{
	if(ts_conn->pbufi != NULL) {
		os_free(ts_conn->pbufi);
		ts_conn->pbufi = NULL;
		ts_conn->sizei = 0;
		ts_conn->cntri = 0;
		return true;
	}
	return false;
}
/******************************************************************************
 * FunctionName : webserver_recv
 * Description  : Processing the received data from the server
 * Parameters   : arg -- Additional argument to pass to the callback function
 *                pusrdata -- The received data (or NULL when the connection has been closed!)
 *                length -- The length of received data
 * Returns      : none
 *
 * For HTTP 1.0, this should normally only happen once (if the request fits in one packet).
 *
*******************************************************************************/
LOCAL err_t ICACHE_FLASH_ATTR webserver_received_data(TCP_SERV_CONN *ts_conn)
{
#if DEBUGSOO > 1
    tcpsrv_print_remote_info(ts_conn);
    os_printf("read: %d ", ts_conn->sizei);
#endif
    WEB_SRV_CONN *web_conn = ReNew_web_conn(ts_conn);
    if(web_conn == NULL) {
#if DEBUGSOO > 1
        os_printf("err mem!\n");
#endif
    	return ERR_MEM;
    }
    if(CheckSCB(SCB_CLOSED | SCB_DISCONNECT | SCB_FCLOSE )) // обрабатывать нечего
    	return ERR_OK;

    web_conn->udata_start = 0;
    web_conn->udata_stop = 0;
    HTTP_CONN CurHTTP;     // Current HTTP connection state
    os_memset(&CurHTTP, 0, sizeof(CurHTTP));
    CurHTTP.httpStatus = 200; // OK
    CurHTTP.fileType = HTTP_UNKNOWN;
    // прием и обработка заголовка HHTP
    if(!CheckSCB(SCB_HEAD_OK)) { // заголовок уже принят и обработан? нет
		ts_conn->flag.rx_buf = 1; // докачивать буфер
		tcpsrv_unrecved_win(ts_conn);
		// разбираем докачан или нет заголовок HTTP, что там принято GET или POST и открываем файл и прием content, если это POST и не прием файла.
    	if(parse_header(&CurHTTP, ts_conn)) { // заголовок полный? нет
    		if(ts_conn->sizei < MAX_HTTP_HEAD_BUF) {
#if DEBUGSOO > 4
				os_printf("buf");
#endif
#if DEBUGSOO > 1
				os_printf("...\n");
#endif
				return ERR_OK; // будем принимать ещё.
    		};
    	   	CurHTTP.httpStatus = 413; // 413 Request Entity Too Large // пока так
		};
    	// разбор заголовка
#if DEBUGSOO > 1
#ifdef WEBSOCKET_ENA
		os_printf("%s f[%s] ", (CheckSCB(SCB_POST))? "POST" : (CheckSCB(SCB_WEBSOC))? "WEBSOC" : "GET", CurHTTP.pFilename);
#else
		os_printf("%s f[%s] ", (CheckSCB(SCB_POST))? "POST" : "GET", CurHTTP.pFilename);
#endif
#endif
#if DEBUGSOO > 3
		os_printf("hcn:%p[%d],wcn:%d ", CurHTTP.pcontent, CurHTTP.content_len, web_conn->content_len);
#endif
	    if(CurHTTP.httpStatus == 200) { // && CheckSCB(SCB_FOPEN)) { // если файл открыт и всё OK
			if(CurHTTP.cookie_len != 0) web_parse_cookie(&CurHTTP, ts_conn);
			web_parse_uri_vars(&CurHTTP, ts_conn);
			if(CurHTTP.pcontent != NULL) {
				if(CheckSCB(SCB_RXDATA)) {
					if(web_conn->content_len) { // с заголовком приняли кусок данных файла?
#if DEBUGSOO > 3
						os_printf("trim:%u[%u] ", web_conn->content_len, CurHTTP.content_len);
#endif
						if(!web_trim_bufi(ts_conn, CurHTTP.pcontent, CurHTTP.content_len)) {
#if DEBUGSOO > 1
							os_printf("trim error!\n");
#endif
							CurHTTP.httpStatus = 500;
						};
					};
				}
				else {
					if(CurHTTP.content_len != 0) web_parse_content(&CurHTTP, ts_conn);
				};
			};
		};
    	SetSCB(SCB_HEAD_OK); // заголовок принят и обработан
	};
#if DEBUGSOO > 3
   	os_printf("tst_rx: %u, %u, %u ", CurHTTP.httpStatus, (CheckSCB(SCB_RXDATA) != 0), web_conn->content_len );
#endif
    if(CurHTTP.httpStatus == 200 && CheckSCB(SCB_RXDATA) && (web_conn->content_len) && web_rx_buf(&CurHTTP,ts_conn)) {
#if DEBUGSOO > 1
    	os_printf("...\n");
#endif
    	return ERR_OK; // докачивать content
    };
    ts_conn->flag.rx_null = 1; // всё - больше не принимаем!
	ts_conn->flag.rx_buf = 0; // не докачивать буфер
	if(web_feee_bufi(ts_conn)) tcpsrv_unrecved_win(ts_conn); // уничтожим буфер

    if(tcp_sndbuf(ts_conn->pcb) >= HTTP_SEND_SIZE) {

