pvvx/esp8266web/app/web/web_srv.c
#ifdef WEBSOCKET_ENA
			if(CheckSCB(SCB_WEBSOC)) {
				// вывод ответа websoc и переключение tcp callback у tcpsrv
				websoc_headers(&CurHTTP, ts_conn);
			}
			else
#else
			{
				// создание и вывод заголовка ответа.
				web_print_headers(&CurHTTP, ts_conn);
			}
#endif

        // начало предачи файла, если есть
        if((!CheckSCB(SCB_CLOSED | SCB_DISCONNECT | SCB_FCLOSE))&&CheckSCB(SCB_FOPEN)) webserver_send_fdata(ts_conn);
    }
    else {
#if DEBUGSOO > 1
    	os_printf("sndbuf=%u! ", tcp_sndbuf(ts_conn->pcb));
#endif
    	SetSCB(SCB_FCLOSE | SCB_DISCONNECT);
    };
    if(CheckSCB(SCB_FCLOSE))  {
        tcp_output(ts_conn->pcb);
    	Close_web_conn(ts_conn);
    	SetSCB(SCB_DISCONNECT);
    }
    if(CheckSCB(SCB_DISCONNECT)) web_int_disconnect(ts_conn);
#if DEBUGSOO > 1
    else  os_printf("...\n");
#endif
    return ERR_OK;
}
/******************************************************************************
 * web_int_disconnect
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR web_int_disconnect(TCP_SERV_CONN *ts_conn)
{
#if DEBUGSOO > 1
    os_printf("dis\n");
#endif
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	ts_conn->flag.tx_null = 1;
	ts_conn->flag.rx_null = 1;
	tcpsrv_unrecved_win(ts_conn);
	if(ts_conn->flag.pcb_time_wait_free) tcpsrv_disconnect(ts_conn);
	SetSCB(SCB_CLOSED);
}
/******************************************************************************
 * FunctionName : webserver_sent_cb
 * Description  : Sent callback function to call for this espconn when data
 *                is successfully sent
 * Parameters   : arg -- Additional argument to pass to the callback function
 * Returns      : none
*******************************************************************************/
LOCAL err_t ICACHE_FLASH_ATTR webserver_sent_callback(TCP_SERV_CONN *ts_conn)
{
#if DEBUGSOO > 1
    tcpsrv_print_remote_info(ts_conn);
#endif
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	if(web_conn == NULL) return ERR_ARG;
    if(CheckSCB(SCB_CLOSED) == 0) { // No SCB_CLOSED
        if((!CheckSCB(SCB_CLOSED | SCB_DISCONNECT | SCB_FCLOSE))&&CheckSCB(SCB_FOPEN)) webserver_send_fdata(ts_conn);
        if(CheckSCB(SCB_FCLOSE))  {
        	Close_web_conn(ts_conn);
        	SetSCB(SCB_DISCONNECT);
        }
        if(CheckSCB(SCB_DISCONNECT))  web_int_disconnect(ts_conn);
    #if DEBUGSOO > 1
        else  os_printf("...\n");
    #endif
    }
    else { //  SCB_CLOSED
#if DEBUGSOO > 1
      os_printf("#%04x ?\n", web_conn->webflag);
#endif
      ts_conn->flag.tx_null = 1;
      ts_conn->flag.rx_null = 1;
    };
    return ERR_OK;
}
/******************************************************************************
 * FunctionName : webserver_disconnect
 * Description  : calback disconnect
 * Parameters   : arg -- Additional argument to pass to the callback function
 * Returns      : none
*******************************************************************************/
LOCAL void ICACHE_FLASH_ATTR webserver_disconnect(TCP_SERV_CONN *ts_conn)
{
#if DEBUGSOO > 1
    tcpsrv_disconnect_calback_default(ts_conn);
#endif
	WEB_SRV_CONN *web_conn = (WEB_SRV_CONN *)ts_conn->linkd;
	if(web_conn == NULL) return;
    Close_web_conn(ts_conn);
	if(CheckSCB(SCB_SYSSAVE)) {
		ClrSCB(SCB_SYSSAVE);
		sys_write_cfg();
	}
	if(web_conn->web_disc_cb != NULL) {
		web_conn->web_disc_cb(web_conn->web_disc_par);
	}
}
/******************************************************************************
 * FunctionName : webserver_init
 * Description  : Открытие сервера
 * Parameters   : arg -- port N
 * Returns      : none
*******************************************************************************/
err_t ICACHE_FLASH_ATTR webserver_init(uint16 portn)
{
	WEBFSInit(); // файловая система

	err_t err = ERR_OK;

	TCP_SERV_CFG *p = tcpsrv_init(portn);
	if (p != NULL) {
		// изменим конфиг на наше усмотрение:
		if(syscfg.cfg.b.web_time_wait_delete) p->flag.pcb_time_wait_free = 1; // пусть убивает, для теста и проксей
		p->max_conn = 99; // сработает по heap_size
#if DEBUGSOO > 0
		os_printf("Max connection %d, time waits %d & %d, min heap size %d\n",
				p->max_conn, p->time_wait_rec, p->time_wait_cls, p->min_heap);
#endif
		// слинкуем с желаемыми процедурами:
	 	p->func_discon_cb = webserver_disconnect;
//	 	p->func_listen = webserver_listen; // не требуется
	 	p->func_sent_cb = webserver_sent_callback;
		p->func_recv = webserver_received_data;
		err = tcpsrv_start(p);
		if (err != ERR_OK) tcpsrv_close(p);
	}
	else err = ERR_MEM;
	return err;
}

/******************************************************************************
 * FunctionName : webserver_close
 * Description  : закрытие сервера
 * Parameters   : arg -- port N
 * Returns      : none
*******************************************************************************/
err_t ICACHE_FLASH_ATTR webserver_close(uint16 portn)
{
	return tcpsrv_close(tcpsrv_server_port2pcfg(portn));
}
/******************************************************************************
 * FunctionName : webserver_reinit
 * Description  : закрытие сервера и открытие нового
 * Parameters   : arg -- port N открытого порта
 * Returns      : none
*******************************************************************************/
err_t ICACHE_FLASH_ATTR webserver_reinit(uint16 portn)
{
	err_t err = ERR_OK;
//	if(portn == syscfg.web_port) return err;
	if(portn) err = tcpsrv_close(tcpsrv_server_port2pcfg(portn)); // зарыть старый порт
	if(syscfg.web_port) err = webserver_init(syscfg.web_port); // открыть новый
	return err;
}
